namespace MyPerfume.Data.Seeding
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Threading.Tasks;

    using MyPerfume.Data.Models;

    public class HeartNotesSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.HeartNotes.Any())
            {
                return;
            }

            var heartNotes = new List<string>() { "Агар", "Азалия", "Амбър", "Атласки кедър", "Африкански портокалов цвят", "Бадеми", "Бели цветя", "Божур", "Бръшлян", "Българска лавандула", "Бял ирис", "Бял кедър", "Бял мускус", "Бял", "пелин", "Бял чай", "Бяла лилия", "Ванилия", "Ветивер", "Виолетови листа", "Водни нотки", "Водния зюмбюл", "Гардения", "Градински чай", "Грейпфрут", "Гуаяк", "Дамаска роза", "Дива роза", "Дъб", "Дъбов мъх", "Египетски жасмин", "Жасмин", "Жасмин самбак", "Звездовиден анасон", "Здравец", "Зелен чай", "Зелена ябълка", "Зелени нотки", "Зърна тонка", "Зюмбюл", "Иланг-иланг", "Индийско орехче", "Ирис", "Кайсия", "Какао", "Канела", "Карамфил", "Катран", "Кафе", "Кафе на зърна", "Кашмирово дърво", "Кедър", "Кимион", "Китайски пипер", "Клементин цветя", "Кожа", "Корен от Перуника", "Кориандър", "Крем", "Лабданум", "Лавандула", "Лилия", "Лимонена трева", "Лотос", "Люляк", "Магнолия", "Майска роза", "Малина", "Манго", "Мандарина", "Мароканска роза", "Мате", "Мед", "Мента", "Мира", "Момина сълза", "Морска трева", "Мускус", "Нарцис", "Нероли", "Олибан", "Опопанакс", "Орлови нокти", "Орхидея", "Османтус", "Пасифлора", "Пачули", "Пипер", "Плодовете на хвойна", "Плодови нотки", "Плюмерия", "Подправки", "Портокалов цвят", "Пралина ", "Праскова", "Пудрен акорд", "Ревен", "Роза", "Розмарин", "Розов божур", "Розов пипер", "Салвия", "Самбак", "Сандалово дърво", "Семена от хибискус", "Сива амбра", "Смокини", "Сол", "Сусам", "Тамян", "Теменужка", "Тиара цвете", "Тиаре", "Тубероза", "Тунизийски нероли", "Турска роза", "Тютюн", "Тютюнево цвете", "Флердоранж", "Флорални нотки", "Фрезия", "Хедион", "Хелиотроп", "Цвят на лимон", "Цвят на мандариново дърво", "Цвят на Маслин", "Цвят на памук", "Цвят на портокала,", "Чай", "Чампака", "Червена Боровинка", "Червена лилия", "Черешов цвят", "Черната далия", "Шибой", "Ягоди" };

            foreach (var heartNote in heartNotes)
            {
                await dbContext.HeartNotes.AddAsync(new HeartNote { Name = heartNote });
            }
        }
    }
}
